In [2]:
import pandas as pd
import numpy as np

# Series

### 1. Write a Pandas program to create and display a one-dimensional array-like object containing an array of data using Pandas module. => [2, 4, 6, 8, 10]

In [2]:
data = [2, 4, 6, 8, 10]
s = pd.Series(data)
s

0     2
1     4
2     6
3     8
4    10
dtype: int64

### **2. Write a Pandas program to add, subtract, multiple and divide two Pandas Series.** 

   **Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]**

In [3]:
d1 = np.arange(2, 12, 2)
d2 = np.arange(1, 11, 2)
s1 = pd.Series(d1)
s2 = pd.Series(d2)

print("ADD : S1 + S2")
print("-------------")
print(s1 + s2)
print()

print("SUB : S1 - S2")
print("-------------")
print(s1 - s2)
print()

print("MUL : S1 * S2")
print("-------------")
print(s1 * s2)
print()

print("DIV : S1 / S2")
print("-------------")
print(s1 / s2)

ADD : S1 + S2
-------------
0     3
1     7
2    11
3    15
4    19
dtype: int64

SUB : S1 - S2
-------------
0    1
1    1
2    1
3    1
4    1
dtype: int64

MUL : S1 * S2
-------------
0     2
1    12
2    30
3    56
4    90
dtype: int64

DIV : S1 / S2
-------------
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

### **3. Write a Pandas program to compare the elements of the two Pandas Series.**
   
   **Sample Series: [2, 4, 6, 8, 10], [1, 3, 5, 7, 10]**

In [4]:
d1 = np.arange(2, 12, 2)
d2 = np.arange(1, 11, 2)
s1 = pd.Series(d1)
s2 = pd.Series(d2)

print("> : S1 > S2")
print("-------------")
print(s1 > s2)
print()

print("< : S1 < S2")
print("-------------")
print(s1 < s2)
print()

print("== : S1 == S2")
print("-------------")
print(s1 == s2)
print()

print("!= : S1 != S2")
print("-------------")
print(s1 != s2)

> : S1 > S2
-------------
0    True
1    True
2    True
3    True
4    True
dtype: bool

< : S1 < S2
-------------
0    False
1    False
2    False
3    False
4    False
dtype: bool

== : S1 == S2
-------------
0    False
1    False
2    False
3    False
4    False
dtype: bool

!= : S1 != S2
-------------
0    True
1    True
2    True
3    True
4    True
dtype: bool

### **4. Write a Pandas program to add some data to an existing Series.**

   **Sample Series: ['100', '200', 'python', '300.12', '400'], ['500', 'php'] (Object)**

In [5]:
s1 = pd.Series(['100', '200', 'python', '300.12', '400'])
s2 = pd.Series(['500', 'php'])

d = pd.concat([s1, s2])
d

0       100
1       200
2    python
3    300.12
4       400
0       500
1       php
dtype: object

### **5. Write a Pandas program to create a subset of a given series based on value and condition.**

**Sample Series : input [0,1,2,3,4,5,6,7,8,9,10] - value 6 -> output [0,1,2,3,4,5]**

In [6]:
d1 = [0,1,2,3,4,5,6,7,8,9,10]
s1 = pd.Series(d1)
s1[:6]

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [7]:
s1[s1 < 6]

0    0
1    1
2    2
3    3
4    4
5    5
dtype: int64

In [8]:
s = pd.Series(['100', '200', 'python', '300.12', '400'])
print("Original Data Series:")
print(s)
print("\nData Series after adding some data:")
new_s = s.append(pd.Series(['500', 'php']))
print(new_s)
new_s[3] = 999
print(new_s)
print(s)

Original Data Series:
0       100
1       200
2    python
3    300.12
4       400
dtype: object

Data Series after adding some data:
0       100
1       200
2    python
3    300.12
4       400
0       500
1       php
dtype: object
0       100
1       200
2    python
3       999
4       400
0       500
1       php
dtype: object
0       100
1       200
2    python
3    300.12
4       400
dtype: object

In [9]:
data = [['Alex',10],['Bob',12]]
df = pd.DataFrame(data,columns=['Name','Age'])
df

   Name  Age
0  Alex   10
1   Bob   12

# Dataframes

### 6. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.

Sample DataFrame:

exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],

'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],

'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [46]:
exam_data  ={
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [47]:
df = pd.DataFrame(data=exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

### 7. Write a Pandas program to get the first 3 rows of a given DataFrame.

In [12]:
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [13]:
df.iloc[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [14]:
df[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

### 8. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

In [15]:
df[df['score'].isna()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

In [16]:
df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

### 9. Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

In [17]:
df[(df['attempts'] < 2) & (df['score'] > 15.0)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

### 10. Write a Pandas program to change the score in row 'd' to 11.5.

In [18]:
df['score']['d'] = 11.5

/Users/blanchardnicolas/.pyenv/versions/3.7.7/envs/lewagon/lib/python3.7/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [19]:
df['score'].loc['d'] = 6

/Users/blanchardnicolas/.pyenv/versions/3.7.7/envs/lewagon/lib/python3.7/site-packages/pandas/core/indexing.py:671: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)

In [20]:
df.loc['d', 'score'] = 99

In [27]:
df.at['d', 'score'] = 98

In [28]:
df

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James   98.0      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

### 11. Write a Pandas program to replace the ‘qualify' column contains the values 'yes' and 'no' with True and False.

In [22]:
df['qualify'] = df['qualify'].map({'yes' : True, 'no' : False})

In [23]:
df['qualify'] = df['qualify'].replace(True, 'yes')
df['qualify'] = df['qualify'].replace(False, 'no')

In [29]:
df['qualify'] = df['qualify'].replace({'yes' : True, 'no' : False})

In [31]:
df

        name  score  qualify
a  Anastasia   12.5     True
b       Dima    9.0    False
c  Katherine   16.5     True
d      James   98.0    False
e      Emily    9.0    False
f    Michael   20.0     True
g    Matthew   14.5     True
h      Laura    NaN    False
i      Kevin    8.0    False
j      Jonas   19.0     True

### 12. Write a Pandas program to replace the ‘qualify' column contains the values 'yes' and 'no' with True and False. (skip ex. 12 -> 11=12)

### 13. Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [50]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [49]:
df.drop(columns=['attempts'])

        name  score qualify
a  Anastasia   12.5     yes
b       Dima    9.0      no
c  Katherine   16.5     yes
d      James    NaN      no
e      Emily    9.0      no
f    Michael   20.0     yes
g    Matthew   14.5     yes
h      Laura    NaN      no
i      Kevin    8.0      no
j      Jonas   19.0     yes

In [44]:
df.pop('attempts')

a    1
b    3
c    2
d    3
e    2
f    3
g    1
h    1
i    2
j    1
Name: attempts, dtype: int64

In [26]:
del df['attempts']

KeyError: 'attempts'

In [51]:
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

### 14. Write a Pandas program to insert a new column in existing DataFrame.

In [ ]:
df.shape

In [53]:
df['new_column'] = np.zeros(10)

In [ ]:
df['new_column'] = np.ones(10)

In [ ]:
df['new_column'] = np.full(10, 5)

In [ ]:
df

### 15. Write a Pandas program to rename columns of a given DataFrame.

In [ ]:
df.rename(columns={'new_column' : 'n_column'})
df

# Join / Merge

### 16. Write a Pandas program to join the two given dataframes along rows and assign all data.

<img src="./images/exemple.png" alt="drawing" width="200"/>

In [82]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

In [83]:
student_data1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

In [85]:
student_data2

  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [113]:
pd.concat([student_data1, student_data2], ignore_index=True)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S4  Scarlette Fisher    201
6         S5  Carla Williamson    200
7         S6       Dante Morse    198
8         S7    Kaiser William    219
9         S8   Madeeha Preston    201

In [112]:
student_data1.append(student_data2, ignore_index=True)

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S4  Scarlette Fisher    201
6         S5  Carla Williamson    200
7         S6       Dante Morse    198
8         S7    Kaiser William    219
9         S8   Madeeha Preston    201

In [117]:
pd.merge(student_data1, student_data2, how='outer')

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
5         S4  Scarlette Fisher    201
6         S5  Carla Williamson    200
7         S6       Dante Morse    198
8         S7    Kaiser William    219
9         S8   Madeeha Preston    201

### 17. Write a Pandas program to join the two given dataframes along rows and merge with another dataframe along the common column id.

In [96]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

exam_data = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5', 'S7', 'S8', 'S9', 'S10', 'S11', 'S12', 'S13'],
        'exam_id': [23, 45, 12, 67, 21, 55, 33, 14, 56, 83, 88, 12]})

___

In [97]:
student_data = pd.concat([student_data1, student_data2])
student_data_merge = pd.merge(student_data, exam_data, on='student_id')
student_data_merge

  student_id              name  marks  exam_id
0         S1  Danniella Fenton    200       23
1         S2      Ryder Storey    210       45
2         S3      Bryce Jensen    190       12
3         S4         Ed Bernal    222       67
4         S4  Scarlette Fisher    201       67
5         S5       Kwame Morin    199       21
6         S5  Carla Williamson    200       21
7         S7    Kaiser William    219       55
8         S8   Madeeha Preston    201       33

___

In [88]:
student_data1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

In [89]:
student_data2

  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [90]:
exam_data

   student_id  exam_id
0          S1       23
1          S2       45
2          S3       12
3          S4       67
4          S5       21
5          S7       55
6          S8       33
7          S9       14
8         S10       56
9         S11       83
10        S12       88
11        S13       12

In [92]:
student_data = pd.concat([student_data1, student_data2])
student_data

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

In [118]:
pd.merge(student_data, exam_data, on='student_id', how='left')

  student_id              name  marks  exam_id
0         S1  Danniella Fenton    200     23.0
1         S2      Ryder Storey    210     45.0
2         S3      Bryce Jensen    190     12.0
3         S4         Ed Bernal    222     67.0
4         S5       Kwame Morin    199     21.0
5         S4  Scarlette Fisher    201     67.0
6         S5  Carla Williamson    200     21.0
7         S6       Dante Morse    198      NaN
8         S7    Kaiser William    219     55.0
9         S8   Madeeha Preston    201     33.0

# String

### 18. Write a Pandas program to convert all the string values to upper, lower cases in a given pandas series. Also find the length of the string values.

In [181]:
sample = ['X', 'Y', 'Z', 'Aaba', 'Baca', np.nan, 'CABA', None, 'bird', 'horse', 'dog']

In [182]:
s = pd.Series(sample)
s

0         X
1         Y
2         Z
3      Aaba
4      Baca
5       NaN
6      CABA
7      None
8      bird
9     horse
10      dog
dtype: object

In [188]:
list(map(lambda x : x*2, [1, 2, 3, 4]))

[2, 4, 6, 8]

In [187]:
s.map(lambda x : x.upper(), na_action='ignore')

0         X
1         Y
2         Z
3      AABA
4      BACA
5       NaN
6      CABA
7      None
8      BIRD
9     HORSE
10      DOG
dtype: object

In [105]:
# upper
s.str.upper()

0         X
1         Y
2         Z
3      AABA
4      BACA
5       NaN
6      CABA
7      None
8      BIRD
9     HORSE
10      DOG
dtype: object

In [110]:
# lower
s.str.lower()

0         x
1         y
2         z
3      aaba
4      baca
5       NaN
6      caba
7      None
8      bird
9     horse
10      dog
dtype: object

In [136]:
# length of the string values
s.str.len()

0     1.0
1     1.0
2     1.0
3     4.0
4     4.0
5     NaN
6     4.0
7     NaN
8     4.0
9     5.0
10    3.0
dtype: float64

In [139]:
s.map(lambda x : len(str(x)))

0     1
1     1
2     1
3     4
4     4
5     3
6     4
7     4
8     4
9     5
10    3
dtype: int64

In [106]:
p = pd.DataFrame(sample)
p

        0
0       X
1       Y
2       Z
3    Aaba
4    Baca
5     NaN
6    CABA
7    None
8    bird
9   horse
10    dog

In [109]:
p[0].str.lower()

0         x
1         y
2         z
3      aaba
4      baca
5       NaN
6      caba
7      None
8      bird
9     horse
10      dog
Name: 0, dtype: object

### 19. Write a Pandas program to remove whitespaces, left sided whitespaces and right sided whitespaces of the string values of a given pandas series.

In [141]:
sample = [' Green', 'Black ', ' Red ', 'White', ' Pink ']

In [192]:
t = pd.Index(sample)
t.str.strip()
t

Index(['X', 'Y', 'Z', 'Aaba', 'Baca', nan, 'CABA', None, 'bird', 'horse',
       'dog'],
      dtype='object')

In [142]:
s = pd.Series(sample)
s

0     Green
1    Black
2      Red
3     White
4     Pink
dtype: object

In [143]:
# remove whitespaces
s.str.strip()

0    Green
1    Black
2      Red
3    White
4     Pink
dtype: object

In [145]:
# remove left sided whitespaces
s.str.lstrip()

0     Green
1    Black
2      Red
3     White
4     Pink
dtype: object

In [146]:
# remove left sided whitespaces
s.str.rstrip()

0     Green
1     Black
2       Red
3     White
4      Pink
dtype: object

### 20. Write a Pandas program to count of occurrence of a specified substring in a DataFrame column.

In [195]:
sample = {
    'name_code'    : ['c001','c002','c022', 'c2002', 'c2222'], 
    'date_of_birth': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997 '],
    'age'          : [18.5, 21.2, 22.5, 22, 23]
}
substring = '2'
column = 'name_code'

In [196]:
df = pd.DataFrame(sample)
df

  name_code date_of_birth   age
0      c001    12/05/2002  18.5
1      c002    16/02/1999  21.2
2      c022    25/09/1998  22.5
3     c2002    12/02/2022  22.0
4     c2222   15/09/1997   23.0

In [165]:
df['count'] = df['name_code'].str.count('2')
df

  name_code date_of_birth   age  count
0      c001    12/05/2002  18.5      0
1      c002    16/02/1999  21.2      1
2      c022    25/09/1998  22.5      2
3     c2002    12/02/2022  22.0      2
4     c2222   15/09/1997   23.0      4

In [197]:
df['count'] = df['name_code'].map(lambda x : x.count('2'))
df

0    0
1    1
2    2
3    2
4    4
Name: name_code, dtype: int64

### 21. Write a Pandas program to check if a specified column starts with a specified string in a DataFrame.

Test start string : ‘ze’

column : ‘company_code’

In [166]:
df = pd.DataFrame({
    'company_code': ['Abcd','EFGF', 'zefsalf', 'sdfslew', 'zekfsdf'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})

In [168]:
df['startswith'] = df['company_code'].str.startswith('ze')
df

  company_code date_of_sale  sale_amount  startswith
0         Abcd   12/05/2002      12348.5       False
1         EFGF   16/02/1999     233331.2       False
2      zefsalf   25/09/1998         22.5        True
3      sdfslew   12/02/2022    2566552.0       False
4      zekfsdf   15/09/1997         23.0        True

### 22. Write a Pandas program to replace arbitrary values with other values in a given DataFrame.

Replace value ‘A’ to ‘C’

Column : ‘company_code’

In [198]:
df = pd.DataFrame({
    'company_code': ['A','B', 'C', 'D', 'A'],
    'date_of_sale': ['12/05/2002','16/02/1999','25/09/1998','12/02/2022','15/09/1997'],
    'sale_amount': [12348.5, 233331.2, 22.5, 2566552.0, 23.0]
})

In [199]:
df

  company_code date_of_sale  sale_amount
0            A   12/05/2002      12348.5
1            B   16/02/1999     233331.2
2            C   25/09/1998         22.5
3            D   12/02/2022    2566552.0
4            A   15/09/1997         23.0

In [200]:
df['company_code'].replace('A', 'C')

0    C
1    B
2    C
3    D
4    C
Name: company_code, dtype: object

In [173]:
df['replace_A_to_C'] = df['company_code'].str.replace('A', 'C')
df

  company_code date_of_sale  sale_amount replace_A_to_C
0            A   12/05/2002      12348.5              C
1            B   16/02/1999     233331.2              B
2            C   25/09/1998         22.5              C
3            D   12/02/2022    2566552.0              D
4            A   15/09/1997         23.0              C

In [ ]:
df['replace_A_to_C'] = df['company_code'].map(lambda x : x.replace('A', 'C'))
df

# Time

In [209]:
from datetime import datetime

### 23. Write a Pandas program to create

a) Datetime object for Jan 15 2012.

In [203]:
date = pd.to_datetime('Jan 15 2012')
date

Timestamp('2012-01-15 00:00:00')

In [215]:
datetime(2012, 1, 15)

datetime.datetime(2012, 1, 15, 0, 0)

b) Specific date and time of 9:20 pm.

In [227]:
pd.to_datetime('Jan 15 2012 21:20:01')
date

Timestamp('2012-01-15 21:20:01')

In [228]:
pd.to_datetime('Jan 15 2012')
date

Timestamp('2012-01-15 21:20:01')

In [232]:
d = datetime(2012, 1, 15, 21, 20)
d

datetime.datetime(2012, 1, 15, 21, 20)

c) Local date and time.

In [207]:
pd.datetime.now()

/Users/blanchardnicolas/.pyenv/versions/3.7.7/envs/lewagon/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: The pandas.datetime class is deprecated and will be removed from pandas in a future version. Import from datetime module instead.
  """Entry point for launching an IPython kernel.

datetime.datetime(2021, 5, 14, 15, 39, 14, 730819)

In [226]:
datetime.now()

datetime.datetime(2021, 5, 14, 15, 46, 44, 968189)

d) A date without time.

In [233]:
d.date()

datetime.date(2012, 1, 15)

e) Current date.

In [224]:
datetime.now().date()

datetime.date(2021, 5, 14)

f) Time from a datetime.

In [234]:
d.time()

datetime.time(21, 20)

g) Current local time.

In [225]:
datetime.now().time()

datetime.time(15, 45, 27, 726789)

### 24.Write a Pandas program to print the day after and before a specified date. Also print the days between two given dates.

In [238]:
d1 = pd.Timedelta('1 day')
d = datetime(2010, 2, 25)
print(d)
print(d + d1)
print(d - d1)

2010-02-25 00:00:00
2010-02-26 00:00:00
2010-02-24 00:00:00

In [250]:
d1 = pd.Timedelta(days = 1)
d = datetime(2010, 2, 25)
print(d)
print(d + d1)
print(d - d1)

2010-02-25 00:00:00
2010-02-26 00:00:00
2010-02-24 00:00:00

In [252]:
a = d+d1
b = d-d1

In [254]:
print(a-b)

2 days, 0:00:00

### 25. Write a Pandas program to create a time-series from a given list of dates as strings.

Sample :

Dates : ['2014-08-01','2014-08-02','2014-08-03','2014-08-04']

Values : rand float

In [248]:
np.random.rand(4)

array([0.04950512, 0.98799318, 0.73619473, 0.40198426])

In [247]:
dates = ['2014-08-01','2014-08-02','2014-08-03','2014-08-04']
pd.Series(np.random.rand(4), dates)

2014-08-01    0.835646
2014-08-02    0.702484
2014-08-03    0.073885
2014-08-04    0.279134
dtype: float64

### 26. Write a Pandas program to create a date range using a startpoint date and a number of periods.

Start : 2020-01-01 - period : 45

In [249]:
pd.date_range('2020-01-01', periods=45)

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10', '2020-01-11', '2020-01-12',
               '2020-01-13', '2020-01-14', '2020-01-15', '2020-01-16',
               '2020-01-17', '2020-01-18', '2020-01-19', '2020-01-20',
               '2020-01-21', '2020-01-22', '2020-01-23', '2020-01-24',
               '2020-01-25', '2020-01-26', '2020-01-27', '2020-01-28',
               '2020-01-29', '2020-01-30', '2020-01-31', '2020-02-01',
               '2020-02-02', '2020-02-03', '2020-02-04', '2020-02-05',
               '2020-02-06', '2020-02-07', '2020-02-08', '2020-02-09',
               '2020-02-10', '2020-02-11', '2020-02-12', '2020-02-13',
               '2020-02-14'],
              dtype='datetime64[ns]', freq='D')

### 27. Write a Pandas program to check if a day is a business day (weekday) or not.

Sample : '2020-12-01' ; '2020-12-06' ; '2020-12-07' ; '2020-12-08' ;

In [265]:
pd.bdate_range('2020-12-05', '2020-12-05')

DatetimeIndex([], dtype='datetime64[ns]', freq='B')

In [267]:
len(pd.bdate_range('2020-12-04', '2020-12-04'))

1

In [261]:
df = pd.DataFrame(['2020-12-01' , '2020-12-06' , '2020-12-07' , '2020-12-08'])
df

            0
0  2020-12-01
1  2020-12-06
2  2020-12-07
3  2020-12-08

In [269]:
def func(x):
    bd = len(pd.bdate_range(x, x))
    if bd:
        return True
    return False

df['is_business_day'] = df[0].map(func)
df

            0  is_business_day
0  2020-12-01             True
1  2020-12-06            False
2  2020-12-07             True
3  2020-12-08             True

### 28. Write a Pandas program to split the following dataframe into groups based on school code. Also check the type of GroupBy object.

In [53]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth ': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': [12, 12, 13, 13, 14, 12],
    'height': [173, 192, 186, 167, 151, 159],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4']},
    index=['S1', 'S2', 'S3', 'S4', 'S5', 'S6'])
df

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

In [37]:
from IPython.display import display, HTML

In [38]:
grouped = df.groupby('school_code')
print("type of groupby :", type(grouped))
print()
for name, group in grouped:
    print(name)
    display(group)

type of groupby : <class 'pandas.core.groupby.generic.DataFrameGroupBy'>

s001

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1

s002

,school_code,class,name,date_Of_Birth,age,height,weight,address
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2

s003

   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3

s004

,school_code,class,name,date_Of_Birth,age,height,weight,address
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

### 29. Write a Pandas program to split the following given dataframe by school code and get mean, min, and max value of age for each school.

In [54]:
df

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

In [56]:
df.groupby('school_code').agg({'age' : ['mean', 'min', 'max']})

              age
             mean min max
school_code
s001         12.5  12  13
s002         13.0  12  14
s003         13.0  13  13
s004         12.0  12  12

In [58]:
df.groupby('school_code')[['age']].agg(['mean', 'min', 'max'])

              age
             mean min max
school_code
s001         12.5  12  13
s002         13.0  12  14
s003         13.0  13  13
s004         12.0  12  12

In [18]:
df.groupby('school_code')['age'].agg(np.mean)
df.groupby('school_code')[['age']].mean()

              age
school_code
s001         12.5
s002         13.0
s003         13.0
s004         12.0

In [20]:
df.groupby('school_code')[['age']].min()

             age
school_code
s001          12
s002          12
s003          13
s004          12

In [21]:
df.groupby('school_code')[['age']].max()

             age
school_code
s001          13
s002          14
s003          13
s004          12

### 30. Write a Pandas program to split the following given dataframe into groups based on school code and class.

In [23]:
df

,school_code,class,name,date_Of_Birth,age,height,weight,address
S1,s001,V,Alberto Franco,15/05/2002,12,173,35,street1
S2,s002,V,Gino Mcneill,17/05/2002,12,192,32,street2
S3,s003,VI,Ryan Parkes,16/02/1999,13,186,33,street3
S4,s001,VI,Eesha Hinton,25/09/1998,13,167,30,street1
S5,s002,V,Gino Mcneill,11/05/2002,14,151,31,street2
S6,s004,VI,David Parkes,15/09/1997,12,159,32,street4

In [24]:
grouped = df.groupby(['school_code', 'class'])
for name, group in grouped:
    print(name)
    print(group)

('s001', 'V')
   school_code class            name date_Of_Birth   age  height  weight  \
S1        s001     V  Alberto Franco     15/05/2002   12     173      35

    address
S1  street1
('s001', 'VI')
   school_code class          name date_Of_Birth   age  height  weight  \
S4        s001    VI  Eesha Hinton     25/09/1998   13     167      30

    address
S4  street1
('s002', 'V')
   school_code class          name date_Of_Birth   age  height  weight  \
S2        s002     V  Gino Mcneill     17/05/2002   12     192      32
S5        s002     V  Gino Mcneill     11/05/2002   14     151      31

    address
S2  street2
S5  street2
('s003', 'VI')
   school_code class         name date_Of_Birth   age  height  weight  address
S3        s003    VI  Ryan Parkes     16/02/1999   13     186      33  street3
('s004', 'VI')
   school_code class          name date_Of_Birth   age  height  weight  \
S6        s004    VI  David Parkes     15/09/1997   12     159      32

    address
S6  street4

### 31. Write a Pandas program to split a dataset, group by one column and get mean, min, and max values by group. Using the following dataset find the mean, min, and max values of purchase amount (purch_amt) group by customer id (customer_id).

In [25]:
df = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})

df

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001

In [29]:
df.groupby('customer_id')[['purch_amt']].mean()

               purch_amt
customer_id
3001          270.650000
3002         2956.953333
3003           75.290000
3004         1983.430000
3005          549.500000
3007         2400.600000
3008          250.450000
3009         1295.450000

In [30]:
df.groupby('customer_id')[['purch_amt']].min()

             purch_amt
customer_id
3001            270.65
3002             65.26
3003             75.29
3004           1983.43
3005            150.50
3007           2400.60
3008            250.45
3009            110.50

In [31]:
df.groupby('customer_id')[['purch_amt']].max()

             purch_amt
customer_id
3001            270.65
3002           5760.00
3003             75.29
3004           1983.43
3005            948.50
3007           2400.60
3008            250.45
3009           2480.40

### 32. Write a Pandas program to detect missing values of a given DataFrame. Display True or False.

In [40]:
df = pd.DataFrame({
'ord_no':[70001,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001],
'salesman_id':[5002,5003,5001,np.nan,5002,5001,5001,np.nan,5003,5002,5003,np.nan]})
print("Original Orders DataFrame:")
df

Original Orders DataFrame:

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN

In [33]:
df.isnull()

    ord_no  purch_amt  ord_date  customer_id  salesman_id
0    False      False     False        False        False
1     True      False     False        False        False
2    False      False      True        False        False
3    False      False     False        False         True
4     True      False     False        False        False
5    False      False     False        False        False
6     True      False     False        False        False
7    False      False     False        False         True
8    False      False     False        False        False
9    False      False     False        False        False
10    True      False     False        False        False
11   False      False     False        False         True

### 33. Write a Pandas program to count the number of missing values in each column of a given DataFrame.

In [41]:
df

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50  2012-10-05         3002       5002.0
1       NaN     270.65  2012-09-10         3001       5003.0
2   70002.0      65.26         NaN         3001       5001.0
3   70004.0     110.50  2012-08-17         3003          NaN
4       NaN     948.50  2012-09-10         3002       5002.0
5   70005.0    2400.60  2012-07-27         3001       5001.0
6       NaN    5760.00  2012-09-10         3001       5001.0
7   70010.0    1983.43  2012-10-10         3004          NaN
8   70003.0    2480.40  2012-10-10         3003       5003.0
9   70012.0     250.45  2012-06-27         3002       5002.0
10      NaN      75.29  2012-08-17         3001       5003.0
11  70013.0    3045.60  2012-04-25         3001          NaN

In [50]:
df.isnull().sum()

ord_no         4
purch_amt      0
ord_date       1
customer_id    0
salesman_id    3
dtype: int64

### 34. (Replace the first row by NaN values) Write a Pandas program to drop the rows where all elements are missing in a given DataFrame.

In [59]:
df = pd.DataFrame({
'ord_no':[np.nan,np.nan,70002,70004,np.nan,70005,np.nan,70010,70003,70012,np.nan,70013],
'purch_amt':[np.nan,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': [np.nan,'2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[np.nan,3001,3001,3003,3002,3001,3001,3004,3003,3002,3001,3001]})

df

     ord_no  purch_amt    ord_date  customer_id
0       NaN        NaN         NaN          NaN
1       NaN     270.65  2012-09-10       3001.0
2   70002.0      65.26         NaN       3001.0
3   70004.0     110.50  2012-08-17       3003.0
4       NaN     948.50  2012-09-10       3002.0
5   70005.0    2400.60  2012-07-27       3001.0
6       NaN    5760.00  2012-09-10       3001.0
7   70010.0    1983.43  2012-10-10       3004.0
8   70003.0    2480.40  2012-10-10       3003.0
9   70012.0     250.45  2012-06-27       3002.0
10      NaN      75.29  2012-08-17       3001.0
11  70013.0    3045.60  2012-04-25       3001.0

In [66]:
df.dropna(axis=0, how='all')

     ord_no  purch_amt    ord_date  customer_id
1       NaN     270.65  2012-09-10       3001.0
2   70002.0      65.26         NaN       3001.0
3   70004.0     110.50  2012-08-17       3003.0
4       NaN     948.50  2012-09-10       3002.0
5   70005.0    2400.60  2012-07-27       3001.0
6       NaN    5760.00  2012-09-10       3001.0
7   70010.0    1983.43  2012-10-10       3004.0
8   70003.0    2480.40  2012-10-10       3003.0
9   70012.0     250.45  2012-06-27       3002.0
10      NaN      75.29  2012-08-17       3001.0
11  70013.0    3045.60  2012-04-25       3001.0

### 35. Write a Pandas program to find and replace the missing values in a given DataFrame which do not have any valuable information.
Example: Missing values: ?, -- ; Replace those values with NaN

In [102]:
df = pd.DataFrame({
'ord_no':[70001,np.nan,70002,70004,np.nan,70005,"--",70010,70003,70012,np.nan,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,"?",12.43,2480.4,250.45, 3045.6],
'ord_date': ['?','2012-09-10',np.nan,'2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3002,3001,3001,3003,3002,3001,3001,3004,"--",3002,3001,3001],
'salesman_id':[5002,5003,"?",5001,np.nan,5002,5001,"?",5003,5002,5003,"--"]})

df

   ord_no purch_amt    ord_date customer_id salesman_id
0   70001     150.5           ?        3002        5002
1     NaN    270.65  2012-09-10        3001        5003
2   70002     65.26         NaN        3001           ?
3   70004     110.5  2012-08-17        3003        5001
4     NaN     948.5  2012-09-10        3002         NaN
5   70005    2400.6  2012-07-27        3001        5002
6      --      5760  2012-09-10        3001        5001
7   70010         ?  2012-10-10        3004           ?
8   70003     12.43  2012-10-10          --        5003
9   70012    2480.4  2012-06-27        3002        5002
10    NaN    250.45  2012-08-17        3001        5003
11  70013    3045.6  2012-04-25        3001          --

In [111]:
df.replace(['?', '--'], np.nan)

     ord_no  purch_amt   ord_date  customer_id  salesman_id
0   70001.0     150.50        NaT       3002.0       5002.0
1       NaN     270.65 2012-09-10       3001.0       5003.0
2   70002.0      65.26        NaT       3001.0          NaN
3   70004.0     110.50 2012-08-17       3003.0       5001.0
4       NaN     948.50 2012-09-10       3002.0          NaN
5   70005.0    2400.60 2012-07-27       3001.0       5002.0
6       NaN    5760.00 2012-09-10       3001.0       5001.0
7   70010.0        NaN 2012-10-10       3004.0          NaN
8   70003.0      12.43 2012-10-10       3000.0       5003.0
9   70012.0    2480.40 2012-06-27       3002.0       5002.0
10      NaN     250.45 2012-08-17       3001.0       5003.0
11  70013.0    3045.60 2012-04-25       3001.0          NaN

In [112]:
df.replace({'?' : np.nan, '--' : np.nan})

     ord_no  purch_amt   ord_date  customer_id  salesman_id
0   70001.0     150.50        NaT       3002.0       5002.0
1       NaN     270.65 2012-09-10       3001.0       5003.0
2   70002.0      65.26        NaT       3001.0          NaN
3   70004.0     110.50 2012-08-17       3003.0       5001.0
4       NaN     948.50 2012-09-10       3002.0          NaN
5   70005.0    2400.60 2012-07-27       3001.0       5002.0
6       NaN    5760.00 2012-09-10       3001.0       5001.0
7   70010.0        NaN 2012-10-10       3004.0          NaN
8   70003.0      12.43 2012-10-10       3000.0       5003.0
9   70012.0    2480.40 2012-06-27       3002.0       5002.0
10      NaN     250.45 2012-08-17       3001.0       5003.0
11  70013.0    3045.60 2012-04-25       3001.0          NaN

### 40!

In [103]:
df

   ord_no purch_amt    ord_date customer_id salesman_id
0   70001     150.5           ?        3002        5002
1     NaN    270.65  2012-09-10        3001        5003
2   70002     65.26         NaN        3001           ?
3   70004     110.5  2012-08-17        3003        5001
4     NaN     948.5  2012-09-10        3002         NaN
5   70005    2400.6  2012-07-27        3001        5002
6      --      5760  2012-09-10        3001        5001
7   70010         ?  2012-10-10        3004           ?
8   70003     12.43  2012-10-10          --        5003
9   70012    2480.4  2012-06-27        3002        5002
10    NaN    250.45  2012-08-17        3001        5003
11  70013    3045.6  2012-04-25        3001          --

In [104]:
df = df.replace(['?', '--'], np.nan)
df

     ord_no  purch_amt    ord_date  customer_id  salesman_id
0   70001.0     150.50         NaN       3002.0       5002.0
1       NaN     270.65  2012-09-10       3001.0       5003.0
2   70002.0      65.26         NaN       3001.0          NaN
3   70004.0     110.50  2012-08-17       3003.0       5001.0
4       NaN     948.50  2012-09-10       3002.0          NaN
5   70005.0    2400.60  2012-07-27       3001.0       5002.0
6       NaN    5760.00  2012-09-10       3001.0       5001.0
7   70010.0        NaN  2012-10-10       3004.0          NaN
8   70003.0      12.43  2012-10-10          NaN       5003.0
9   70012.0    2480.40  2012-06-27       3002.0       5002.0
10      NaN     250.45  2012-08-17       3001.0       5003.0
11  70013.0    3045.60  2012-04-25       3001.0          NaN

In [105]:
df.dtypes

ord_no         float64
purch_amt      float64
ord_date        object
customer_id    float64
salesman_id    float64
dtype: object

In [106]:
df['ord_date'] = pd.to_datetime(df['ord_date'])
df.dtypes

ord_no                float64
purch_amt             float64
ord_date       datetime64[ns]
customer_id           float64
salesman_id           float64
dtype: object

In [107]:
df

     ord_no  purch_amt   ord_date  customer_id  salesman_id
0   70001.0     150.50        NaT       3002.0       5002.0
1       NaN     270.65 2012-09-10       3001.0       5003.0
2   70002.0      65.26        NaT       3001.0          NaN
3   70004.0     110.50 2012-08-17       3003.0       5001.0
4       NaN     948.50 2012-09-10       3002.0          NaN
5   70005.0    2400.60 2012-07-27       3001.0       5002.0
6       NaN    5760.00 2012-09-10       3001.0       5001.0
7   70010.0        NaN 2012-10-10       3004.0          NaN
8   70003.0      12.43 2012-10-10          NaN       5003.0
9   70012.0    2480.40 2012-06-27       3002.0       5002.0
10      NaN     250.45 2012-08-17       3001.0       5003.0
11  70013.0    3045.60 2012-04-25       3001.0          NaN

In [108]:
df.loc[8, 'customer_id'] = 3000
df

     ord_no  purch_amt   ord_date  customer_id  salesman_id
0   70001.0     150.50        NaT       3002.0       5002.0
1       NaN     270.65 2012-09-10       3001.0       5003.0
2   70002.0      65.26        NaT       3001.0          NaN
3   70004.0     110.50 2012-08-17       3003.0       5001.0
4       NaN     948.50 2012-09-10       3002.0          NaN
5   70005.0    2400.60 2012-07-27       3001.0       5002.0
6       NaN    5760.00 2012-09-10       3001.0       5001.0
7   70010.0        NaN 2012-10-10       3004.0          NaN
8   70003.0      12.43 2012-10-10       3000.0       5003.0
9   70012.0    2480.40 2012-06-27       3002.0       5002.0
10      NaN     250.45 2012-08-17       3001.0       5003.0
11  70013.0    3045.60 2012-04-25       3001.0          NaN

In [100]:
df['customer_id'] = pd.to_numeric(df['customer_id'], downcast='integer')
df

     ord_no  purch_amt   ord_date  customer_id  salesman_id
0   70001.0     150.50        NaT         3002       5002.0
1       NaN     270.65 2012-09-10         3001       5003.0
2   70002.0      65.26        NaT         3001          NaN
3   70004.0     110.50 2012-08-17         3003       5001.0
4       NaN     948.50 2012-09-10         3002          NaN
5   70005.0    2400.60 2012-07-27         3001       5002.0
6       NaN    5760.00 2012-09-10         3001       5001.0
7   70010.0        NaN 2012-10-10         3004          NaN
8   70003.0      12.43 2012-10-10         3000       5003.0
9   70012.0    2480.40 2012-06-27         3002       5002.0
10      NaN     250.45 2012-08-17         3001       5003.0
11  70013.0    3045.60 2012-04-25         3001          NaN

In [109]:
pd.to_numeric(df[['customer_id', 'salesman_id']], downcast='integer')

TypeError: arg must be a list, tuple, 1-d array, or Series